[
    {
        "title": "Hi!",
        "paragraphs": [
            "I am Ruben Broekx, a {{age}}-year-old computer geek from Belgium. I'm passionate about Artificial Intelligence and eager to learn, which is why I like to spend my time learning about and experimenting with new concepts within the field.",
            "Since the summer of 2020, I started my first job at <a href='https://radix.ai/' target='_blank'>Radix.ai</a>, a young Artificial Intelligence company where robust AI-powered software solutions are invented, designed and developed. The main focus within the company is on Natural Language Processing.",
            "Outside from work, I like to invest my time discovering new AI technologies. Since I'm convinced that the best way to learn about new concepts is by getting your hands dirty, I've brought several projects to a successful conclusion over the years.",
            "This website shows who I am as well as the projects I've been working on in the past. On this page, you'll find more information about myself. Next, a <i>Projects</i> page gives an overview of all my personal projects found on GitHub. If interested, you can view my Curriculum Vitae as well, as indicated in the menu on the left."
        ],
        "image": "profile_picture.jpg"
    },
    {
        "title": "Work Experience",
        "paragraphs": [
            "<h2 style='color: #424242;'>Radix.ai</h2> As of August 2020, I started my first job at <a href='https://radix.ai/' target='_blank'>Radix.ai</a>. Since then, I brought several projects to a successful conclusion, which all centered around Natural Language Processing. The most notable projects were (1) an algorithm that measures the global sentiment of the Flemish population by analysing Twitter data, and (2) an algorithm that automatically extracted useful information such as job description, expectations, etc. from job vacancies scraped from the web.",
            "<h2 style='color: #424242;'>Nokia Bell Labs</h2> My most notable work experience as a student was at <a href='https://www.bell-labs.com/connect/global-locations/Antwerp-belgium/' target='_blank'>Nokia Bell Labs (Antwerp)</a>, which was during a nine-week internship. During this period, I developed a code summarization artificial neural network. The task given to me was to create a single sentence summary for small Python code snippets. Throughout this internship, I gained knowledge about recurrent neural networks, natural language processing tasks, and the Keras framework.",
            "<h2 style='color: #424242;'>KU Leuven</h2> I pursued two student jobs - both as a teaching assistant - at the <a href='https://wms.cs.kuleuven.be/cs/english' target='_blank'>KU Leuven</a> while I was in the Master's programme. In the first year of my Master, I assisted Bachelor students with their thesis. In the second year of my Master, I was a teaching assistant for an informatics course which taught first bachelors students the fundamentals of programming.",
            "<h2 style='color: #424242;'>SoundTalks NV</h2> During the summer vacation between my Bachelor and Master, I worked at <a href='https://www.soundtalks.com/' target='_blank'>SoundTalks NV</a> as a Python back end developer, using the Django REST Framework. This was the first working experience I had related to Computer Science."
        ],
        "image": "experience.jpg"
    },
    {
        "title": "Education",
        "paragraphs": [
            "<h2 style='color: #424242;'>Master</h2> I pursued a Master in Computer Science Master at the KUL, with a major in Artificial Intelligence, from which I graduated with greatest distinction. My thesis investigated Recurrent Units - specifically the Gated Recurrent Unit - and how these could be applied efficiently in evolved neural networks.",
            "<h2 style='color: #424242;'>Bachelor</h2> I also did my bachelor at the KUL, following a mixed Bachelor of Computer Science and Electrical Engineering, from which I graduated with distinction.",
            "<h2 style='color: #424242;'>High School</h2> I went to Don Bosco Hechtel during my High School days. Here, I followed <i>Mathematics and Sciences</i>, with eight hours of math per week."
        ],
        "image": "education.jpg"
    },
    {
        "title": "Achievements",
        "paragraphs": [
            "My proudest achievement thus far is my Master's thesis, for which I obtained a score of 92.5%. The results of my thesis were used in a scientific paper later on, which I helped to write.",
            "Another, rather similar, achievement was when I received a perfect score (100%) on my Bachelor's thesis. This result allowed me to work as a teaching assistant for the KUL where I helped assist the upcoming Bachelor's thesis."
        ],
        "image": "achievement.jpg"
    },
    {
        "title": "Personal Projects",
        "paragraphs": [
            "In my spare time, I don't like to sit still. As stated earlier, I'm eager to learn new things which is why I often start new side-projects. These projects vary both in their topic - Artificial Intelligence, simple programming solutions, or even the website you're currently on - using an extensive catalogue of programming languages and tools. More information on each of these projects is found on the <i>Projects</i> page, found in the menu on the left."
        ],
        "image": "programming.jpg"
    }
]